# Chapter 7. Data Cleaning and Preparation

In [1]:
import pandas as pd
import numpy as np

## 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull() #detects NAN and None values

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**Table 7-1. NA handling methods**

Argument | Description
--- | ---
**dropna** | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate
**fillna** | Fill in missing data with some value or using an interpolation method such as `ffill` or `bfill`
**isnull** | Return boolean values indicating which values are missing/NA
**notnull** | Negation of `isnull`

### Filtering Out Missing Data

For a Series object:

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

For a DataFrame

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [10]:
cleaned = data.dropna() # by default it drops any row containing a NAN value

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all') # passing how='all' drops only full NaN rows

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all') # drops a full NaN column

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df.iloc[4, 0] = NA
df

          0         1         2
0  0.290973       NaN       NaN
1  0.819113       NaN       NaN
2  0.179736       NaN -0.650610
3 -1.193313       NaN -0.531123
4       NaN  0.271812 -0.530196
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

In [17]:
df.dropna()

          0         1         2
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

In [18]:
df.dropna(thresh=2) # threshhold parameter for NaN number in a row

          0         1         2
2  0.179736       NaN -0.650610
3 -1.193313       NaN -0.531123
4       NaN  0.271812 -0.530196
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

### Filling In Missing Data

In [19]:
df.fillna(0) # substitute NaNs with 0

          0         1         2
0  0.290973  0.000000  0.000000
1  0.819113  0.000000  0.000000
2  0.179736  0.000000 -0.650610
3 -1.193313  0.000000 -0.531123
4  0.000000  0.271812 -0.530196
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

In [20]:
df.fillna({1: 0.5, 2: 0}) # substitute NaNs in each column with a certain value

          0         1         2
0  0.290973  0.500000  0.000000
1  0.819113  0.500000  0.000000
2  0.179736  0.500000 -0.650610
3 -1.193313  0.500000 -0.531123
4       NaN  0.271812 -0.530196
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

In [21]:
_ = df.fillna(0, inplace=True) # modify the existing object in-place
df

          0         1         2
0  0.290973  0.000000  0.000000
1  0.819113  0.000000  0.000000
2  0.179736  0.000000 -0.650610
3 -1.193313  0.000000 -0.531123
4  0.000000  0.271812 -0.530196
5  0.715953  0.457945 -0.775442
6 -0.092203 -1.524502  2.082601

In [22]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.098548 -1.644259  1.349325
1 -0.805714  0.868384  0.032667
2 -0.605220       NaN -0.804852
3 -0.481625       NaN  1.098546
4  0.916343       NaN       NaN
5  1.169496       NaN       NaN

In [23]:
df.fillna(method='ffill')

          0         1         2
0 -0.098548 -1.644259  1.349325
1 -0.805714  0.868384  0.032667
2 -0.605220  0.868384 -0.804852
3 -0.481625  0.868384  1.098546
4  0.916343  0.868384  1.098546
5  1.169496  0.868384  1.098546

In [24]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.098548 -1.644259  1.349325
1 -0.805714  0.868384  0.032667
2 -0.605220  0.868384 -0.804852
3 -0.481625  0.868384  1.098546
4  0.916343       NaN  1.098546
5  1.169496       NaN  1.098546

In [25]:
data = pd.Series([3., NA, 5., NA, 10.])
data.fillna(data.mean())

0     3.0
1     6.0
2     5.0
3     6.0
4    10.0
dtype: float64

**Table 7-2. fillna function arguments**

Argument | Description
--- | ---
**value** | Scalar value or dict-like object to use to fill missing values
**method** | Interpolation; by default 'ffill' if function called with no other arguments
**axis** | Axis to fill on; default axis=0
**inplace** | Modify the calling object without producing a copy
**limit** | For forward and backward filling, maximum number of consecutive periods to fill

## 7.2 Data Transformation

### Removing Duplicates

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated() #returns a boolean array

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates() #returns a DataFrame where the duplicated array is False

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [30]:
data.drop_duplicates(['k1']) #can specify any subset of columns to detect duplicates

    k1  k2  v1
0  one   1   0
1  two   1   1

In [31]:
data.drop_duplicates(['k1', 'k2'], keep='last') #by default keep the first observed value combination

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [32]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
#meat to animal mapping
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [34]:
lowercased = data['food'].str.lower() #lowercasing the food column
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [35]:
data['animal'] = lowercased.map(meat_to_animal) #adding a new column using the mapping
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
data['food'].map(lambda x: meat_to_animal[x.lower()]) #another way to do the same transformation

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [37]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [38]:
data.replace(-999, np.nan) #to do it in place pass inplace=True

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace([-999, -1000], np.nan) #to do it in place pass inplace=True

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [40]:
data.replace([-999, -1000], [np.nan, 0]) #To use a different replacement for each value, pass a list of substitutes

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [41]:
data.replace({-999: np.nan, -1000: 0}) # To use a different replacement for each value, pass a dict of substitutes

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [42]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [44]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [45]:
data.rename(index=str.title, columns=str.upper) #If you want to create a transformed version of a dataset without modifying the original

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [46]:
data.rename(index={'OHIO': 'INDIANA'}, 
            columns={'three': 'peekaboo'}) #rename can be used in conjunction with a dict-like object providing new values for a subset of the axis labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [47]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True) #in-place
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [48]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] #list of 12 different ages
bins = [18, 25, 35, 60, 100] #bins borders
cats = pd.cut(ages, bins) #creating a special Categorical object
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
cats.codes #codes[i] is the category of ages[i]

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [50]:
cats.categories #the distinct category names

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [51]:
pd.value_counts(cats) # the bin counts for the result of pd.cut()

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [52]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False) #change which side is closed by passing right=False

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [53]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior'] #bin names
pd.cut(ages, bins, labels=group_names) #pass bin names to pd.cut()

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [54]:
data = np.random.rand(20) 
pd.cut(data, 4, precision=2) #pass an integer number of bins to cut instead of explicit bin edges, it will compute
#equal-length bins based on the minimum and maximum values in the data

[(0.27, 0.49], (0.49, 0.71], (0.044, 0.27], (0.71, 0.94], (0.044, 0.27], ..., (0.49, 0.71], (0.71, 0.94], (0.27, 0.49], (0.71, 0.94], (0.044, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.044, 0.27] < (0.27, 0.49] < (0.49, 0.71] < (0.71, 0.94]]

In [55]:
#bins the data based on sample quantiles
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.635, 3.279], (-0.636, -0.00395], (-0.636, -0.00395], (0.635, 3.279], (0.635, 3.279], ..., (-3.081, -0.636], (-0.00395, 0.635], (0.635, 3.279], (0.635, 3.279], (-3.081, -0.636]]
Length: 1000
Categories (4, interval[float64]): [(-3.081, -0.636] < (-0.636, -0.00395] < (-0.00395, 0.635] < (0.635, 3.279]]

In [56]:
pd.value_counts(cats)

(0.635, 3.279]        250
(-0.00395, 0.635]     250
(-0.636, -0.00395]    250
(-3.081, -0.636]      250
dtype: int64

In [57]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]) #pass your own quantiles (numbers between 0 and 1, inclusive)

[(-0.00395, 1.257], (-1.242, -0.00395], (-1.242, -0.00395], (1.257, 3.279], (-0.00395, 1.257], ..., (-1.242, -0.00395], (-0.00395, 1.257], (-0.00395, 1.257], (1.257, 3.279], (-3.081, -1.242]]
Length: 1000
Categories (4, interval[float64]): [(-3.081, -1.242] < (-1.242, -0.00395] < (-0.00395, 1.257] < (1.257, 3.279]]

### Detecting and Filtering Outliers

In [58]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013110     0.014582     0.008574    -0.027065
std       1.036965     0.996507     1.009284     0.964301
min      -3.627733    -3.344718    -2.988598    -3.309775
25%      -0.672306    -0.615047    -0.719873    -0.687605
50%      -0.014104    -0.007945     0.001190    -0.051134
75%       0.680877     0.700541     0.740458     0.637724
max       4.105021     3.045349     3.645196     2.676633

In [59]:
col = data[2] #values in one of the columns exceeding 3 in absolute value
col[np.abs(col) > 3]

868    3.645196
Name: 2, dtype: float64

In [60]:
data[(np.abs(data) > 3).any(1)] #select all rows having a value exceeding 3 or 3

            0         1         2         3
34  -1.634646 -0.638306  0.597146 -3.179445
54   0.055929  0.856418  1.513609 -3.309775
105  1.157953 -3.223827  2.279287  0.279961
402  3.015433  1.580489 -2.331006 -0.167865
416  3.468402  0.565823 -1.583359 -0.975559
423 -3.627733 -0.728213  0.284353  1.002236
481  0.027679  3.045349  0.254334  0.118052
640  4.105021  0.872475  0.110648  0.023065
793  3.122625  1.319869 -0.212485 -0.082425
862 -0.116463 -3.030843 -0.831497 -0.016303
868  1.824118  1.139758  3.645196 -0.771621
886  1.957859 -3.344718 -0.315822 -0.627610

In [61]:
data[np.abs(data) > 3] = np.sign(data) * 3 #np.sign(data) produces 1 and 1 values based on whether the values in data are positive or negative
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.012026     0.015136     0.007929    -0.026576
std       1.029282     0.994468     1.007161     0.962723
min      -3.000000    -3.000000    -2.988598    -3.000000
25%      -0.672306    -0.615047    -0.719873    -0.687605
50%      -0.014104    -0.007945     0.001190    -0.051134
75%       0.680877     0.700541     0.740458     0.637724
max       3.000000     3.000000     3.000000     2.676633

In [62]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0  1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [63]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5) #Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering
sampler

array([3, 4, 0, 1, 2])

In [64]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [65]:
df.take(sampler) #array can then be used in iloc-based indexing or the equivalent take function:

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11

In [66]:
df.sample(n=3) #a random subset without replacement

   0  1   2   3
0  0  1   2   3
2  8  9  10  11
1  4  5   6   7

In [67]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True) #generate a sample with replacement (to allow repeat choices)
draws

2   -1
1    7
4    4
0    5
4    4
3    6
4    4
3    6
0    5
1    7
dtype: int64

### Computing Indicator/Dummy Variables

In [68]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [69]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [70]:
dummies = pd.get_dummies(df['key'], prefix='key') #add a prefix to the column names in the indicator DataFrame, which can then be merged with the other data
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [71]:
mnames = ['movie_id', 'title', 'genres'] #Lets look at the MovieLens 1M dataset
movies = pd.read_table('movies.dat.txt', sep='::', header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [72]:
#Adding indicator variables for each genre requires a little bit of wrangling
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [73]:
#One way to construct the indicator DataFrame is to start with a DataFrame of all zeros
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [74]:
#Now, iterate through each movie and set entries in each row of dummies to 1
#To do this, we use the dummies.columns to compute the column indices for each genre
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int32)

In [75]:
#Then, we can use .iloc to set values based on these indices
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [76]:
#Then, as before, you can combine this with movies
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

A useful recipe for statistical applications is to combine get_dummies with a discretization
function like cut

In [77]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [78]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 String Manipulation

### Built-In String Object Methods

In [79]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [80]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [81]:
'::'.join(pieces)

'a::b::guido'

In [82]:
'guido' in val

True

In [83]:
val.index(',') #index raises an exception if the string isnt found

1

In [84]:
val.find(':') #find returns -1 if the string isn't found

-1

In [85]:
val.count(',')

2

In [86]:
val.replace(',', '::')

'a::b:: guido'

**Python built-in string methods**

Argument | Description
---|---
count | Return the number of non-overlapping occurrences of substring in the string.
endswith | Returns True if string ends with suffix.
startswith | Returns True if string starts with prefix.
join |Use string as delimiter for concatenating a sequence of other strings.
index |Return position of first character in substring if found in the string; raises ValueError if not found.
find |Return position of first character of first occurrence of substring in the string; like index, but returns 1 if not found.
rfind |Return position of first character of last occurrence of substring in the string; returns 1 if not found.
replace |Replace occurrences of string with another string.
strip, rstrip, lstrip |Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip, respectively) for each element.
split| Break string into list of substrings using passed delimiter.
lower |Convert alphabet characters to lowercase.
upper |Convert alphabet characters to uppercase.
casefold |Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form.
ljust, rjust |Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width.

### Regular Expressions

In [87]:
import re

The re module functions fall into three categories: **pattern matching**, **substitution**, and **splitting**.

In [88]:
text = "foo bar\t baz \tqux"
re.split('\s+', text) #quick and dirty way to split the text

['foo', 'bar', 'baz', 'qux']

In [89]:
reg = re.compile('\s+') #longer way to split the text with the reusable regex object
re.split(reg, text)

['foo', 'bar', 'baz', 'qux']

In [90]:
reg.findall(text) #pattern matching

[' ', '\t ', ' \t']

Creating a regex object with re.compile is highly recommended if you intend to
apply the same expression to many strings; doing so will save CPU cycles.

_match_ and _search_ are closely related to _findall_. While _findall_ returns all matches
in a string, _search_ returns only the first match. More rigidly, _match_ only matches at
the beginning of the string.

In [91]:
text = """
Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

_search_ returns a special match object for the first email address in the text. For the
preceding regex, the match object can only tell us the start and end position of the
pattern in the string.

In [92]:
m = regex.search(text)
m

In [93]:
text[m.start():m.end()] #match object methods

'dave@google.com'

In [94]:
print(regex.match(text))

None

_sub_ will return a new string with occurrences of the pattern replaced by the
a new string

In [95]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suppose you wanted to find email addresses and simultaneously segment each
address into its three components: username, domain name, and domain suffix. To
do this, put parentheses around the parts of the pattern to segment. _groups_ method.

In [96]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [97]:
regex.findall(text) #returns a tuple of all matches

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

sub also has access to groups in each match using special symbols like \1 and \2. The
symbol \1 corresponds to the first matched group, \2 corresponds to the second, and
so forth:

In [98]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

**Table 7-4. Regular expression methods**

Argument| Description
---|---
findall |Return all non-overlapping matching patterns in a string as a list
finditer |Like findall, but returns an iterator
match |Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches, returns a match object, and otherwise None
search |Scan string for match to pattern; returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning
split |Break string into pieces at each occurrence of pattern
sub, subn |Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string

### Vectorized String Functions in pandas

Cleaning up a messy dataset for analysis often requires a lot of string munging and
regularization. To complicate matters, a column containing strings will sometimes
have missing data:

In [99]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [100]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

You can apply string and regular expression methods can be applied (passing a
lambda or other function) to each value using data.map, but it will fail on the NA
(null) values. To cope with this, Series has array-oriented methods for string operations
that skip NA values. These are accessed through Seriess str attribute; for example,
we could check whether each email address has 'gmail' in it with str.contains:

In [101]:
data.str.contains('gmail') #skipping NAN values

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [102]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [103]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

There are a couple of ways to do vectorized element retrieval. Either use str.get or
index into the str attribute:

In [104]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [105]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [106]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

You can similarly slice strings using this syntax:

In [107]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

**Table 7-5. Partial listing of vectorized string methods**

Method | Description
---|---
cat |Concatenate strings element-wise with optional delimiter
contains |Return boolean array if each string contains pattern/regex
count |Count occurrences of pattern
extract |Use a regular expression with groups to extract one or more strings from a Series of strings; the result will be a DataFrame with one column per group
endswith |Equivalent to x.endswith(pattern) for each element
startswith | Equivalent to x.startswith(pattern) for each element
findall |Compute list of all occurrences of pattern/regex for each string get Index into each element (retrieve i-th element)
isalnum |Equivalent to built-in str.alnum
isalpha |Equivalent to built-in str.isalpha
isdecimal |Equivalent to built-in str.isdecimal
isdigit |Equivalent to built-in str.isdigit
islower |Equivalent to built-in str.islower
isnumeric |Equivalent to built-in str.isnumeric
isupper |Equivalent to built-in str.isupper
join |Join strings in each element of the Series with passed separator
len |Compute length of each string
lower, upper |Convert cases; equivalent to x.lower() or x.upper() for each element
match |Use re.match with the passed regular expression on each element, returning matched groups as list
pad |Add whitespace to left, right, or both sides of strings
center |Equivalent to pad(side='both')
repeat |Duplicate values (e.g., s.str.repeat(3) is equivalent to x * 3 for each string)
replace |Replace occurrences of pattern/regex with some other string
slice |Slice each string in the Series
split |Split strings on delimiter or regular expression
strip |Trim whitespace from both sides, including newlines
rstrip |Trim whitespace on right side
lstrip|Trim whitespace on left side